<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Identifier</key>
		<string>com.github.jarias.munki.basictex</string>
		<key>Description</key>
		<string>Downloads BasicTex and imports into Munki.</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>BasicTex</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/BasicTex</string>
			<key>VERSION</key>
			<string>20150613</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>display_name</key>
                <string>%NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
			</dict>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>http://mirror.ctan.org/systems/mac/mactex/basictex-%VERSION%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
