<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Identifier</key>
		<string>com.github.jarias.munki.chefdk</string>
		<key>Description</key>
		<string>Downloads Chefdk and imports into Munki.</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Chefdk</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/Chefdk</string>
			<key>VERSION</key>
			<string>0.3.5-1</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>display_name</key>
				<string>%NAME%</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>version</key>
				<string>%VERSION%</string>
			</dict>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://downloads.getchef.com/chef-dk/mac/</string>
					<key>re_pattern</key>
					<string>(?P&lt;url&gt;https://opscode-omnibus-packages.s3.amazonaws.com/mac_os_x/10.8/x86_64/chefdk-.*$\.dmg)</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>