<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest Oracle Java 11 JDK and imports into Munki.
    </string>
    <key>Identifier</key>
    <string>com.github.jarias.munki.OpenJDK11</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>system/java</string>
      <key>NAME</key>
      <string>OpenJDK11</string>
      <key>VERSION</key>
      <string>11.0.3</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>description</key>
        <string>Java SE Runtime Environment 11 enables support for running Java-powered applets and applications.</string>
        <key>display_name</key>
        <string>OpenJDK 11</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>version</key>
        <string>%VERSION%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>https://github.com/AdoptOpenJDK/openjdk11-binaries/releases/download/jdk-11.0.3%2B7/OpenJDK11U-jdk_x64_mac_hotspot_11.0.3_7.pkg</string>
          <key>filename</key>
          <string>%NAME%.pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict>
</plist>
