<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest Oracle Java 8 JRE and imports into Munki.

            To use this recipe, you must accept the Oracle Binary Code License Agreement for Java SE.
            http://www.oracle.com/technetwork/java/javase/terms/license/index.html

            The package's receipt version is useless, so we make an installs item for
            the prefPane bundle, which has historically had consistent versioning.
        </string>
        <key>Identifier</key>
        <string>com.github.jarias.munki.OracleJava8</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>system/java</string>
            <key>NAME</key>
            <string>OracleJDK8</string>
            <key>VERSION</key>
            <string>1.8.0_73</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Java SE Runtime Environment 8 enables support for running Java-powered applets and applications.</string>
                <key>display_name</key>
                <string>Oracle Java 8</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>version</key>
                <string>%VERSION%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>http://download.oracle.com/otn-pub/java/jdk/8u73-b02/jdk-8u73-macosx-x64.dmg</string>
                    <key>request_headers</key>
                    <dict>
                        <key>Cookie</key>
                        <string>oraclelicense=accept-securebackup-cookie</string>
                    </dict>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
