<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the current release version of HoRNDIS and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jarias.munki.HoRNDIS</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>HoRNDIS</string>
      <key>VERSION</key>
      <string>7</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>system/drivers</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>description</key>
        <string></string>
        <key>display_name</key>
        <string>HoRNDIS</string>
        <key>version</key>
        <string>%VERSION%</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>developer</key>
        <string>Joshua Wise</string>
        <key>category</key>
        <string>Drivers</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>

    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>https://github.com/jwise/HoRNDIS/releases/download/rel%VERSION%/HoRNDIS-rel%VERSION%.pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
