<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the current release version of Mono MDK and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jarias.munki.MonoMDK</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Mono MDK</string>
      <key>VERSION</key>
      <string>4.4.2.11</string>
      <key>BASE_VERSION</key>
      <string>4.4.2</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>system/MonoMDK</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>description</key>
        <string></string>
        <key>display_name</key>
        <string>Mono MDK</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
        <key>unattended_uninstall</key>
        <true/>
      </dict>
    </dict>

    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>http://download.mono-project.com/archive/%BASE_VERSION%/macos-10-universal/MonoFramework-MDK-%VERSION%.macos10.xamarin.universal.pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict>
</plist>
