<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of Sublime Text 2.</string>
        <key>Input</key>
        <dict>
            <key>IDENTIFIER</key>
            <string>com.github.jarias.download.SublimeText2</string>
            <key>NAME</key>
            <string>SublimeText2</string>
            <key>SPARKLE_FEED_URL</key>
            <string>http://www.sublimetext.com/updates/2/stable/appcast_osx.xml</string>
        </dict>

        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>SparkleUpdateInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>appcast_url</key>
                    <string>%SPARKLE_FEED_URL%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>