<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Identifier</key>
    <string>com.github.jarias.munki.PyCharmCE</string>
    <key>Description</key>
    <string>Downloads PyCharm CE and imports into Munki.</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>PyCharmCE</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/jetbrains</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>description</key>
        <string>The intelligent Python IDE with unique code assistance and analysis, for productive Python development on all levels.</string>
        <key>display_name</key>
        <string>%NAME%</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>category</key>
        <string>Development</string>
        <key>developer</key>
        <string>JetBrains s.r.o.</string>
        <key>postinstall_script</key>
        <string>#!/bin/sh
          /usr/libexec/PlistBuddy -c 'Set :JVMOptions:JVMVersion 1.8+' "/Applications/PyCharm CE.app/Contents/Info.plist"
          exit 0
        </string>
      </dict>
    </dict>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>https://data.services.jetbrains.com/products/releases?code=PCC</string>
          <key>re_pattern</key>
          <string>(?P&lt;url&gt;https:\/\/download\.jetbrains\.com\/python\/pycharm-community-(\*|\d+(\.\d+){0,2}(\.\*)?)\.dmg)</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>filename</key>
          <string>%NAME%.dmg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict>
</plist>
