<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Identifier</key>
		<string>com.github.jarias.munki.RubyMine</string>
		<key>Description</key>
		<string>Downloads RubyMine and imports into Munki.</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>RubyMine</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/jetbrains</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>The Most Intelligent Ruby and Rails IDE.</string>
				<key>display_name</key>
				<string>%NAME%</string>
				<key>name</key>
				<string>%NAME%</string>
                <key>category</key>
                <string>Development</string>
                <key>developer</key>
                <string>JetBrains s.r.o.</string>
				<key>postinstall_script</key>
				<string>#!/bin/sh
					/usr/libexec/PlistBuddy -c 'Set :JVMOptions:JVMVersion 1.8+' "/Applications/RubyMine.app/Contents/Info.plist"
					exit 0
				</string>
			</dict>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://data.services.jetbrains.com/products/releases?code=RM</string>
					<key>re_pattern</key>
					<string>(?P&lt;url&gt;https:\/\/download\.jetbrains\.com\/ruby\/RubyMine-(?:0|[1-9][0-9]*)\.(?:0|[1-9][0-9]*)\.(?:0|[1-9][0-9]*)-custom-jdk-bundled\.dmg)</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
