<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Input</key>
    <dict>
      <key>IDENTIFIER</key>
      <string>com.github.jarias.munki.GoogleTalkPlugin</string>
      <key>NAME</key>
      <string>GoogleTalkPlugin</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/Google/GoogleTalkPlugin</string>
      <key>DOWNLOAD_URL</key>
      <string>https://dl.google.com/googletalk/googletalkplugin/GoogleVoiceAndVideoSetup.dmg</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>description</key>
        <string>Plugin for Google Hangouts and Gmail voice and video.</string>
        <key>display_name</key>
        <string>Google Talk Plugin</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
        <key>installer_choices_xml</key>
        <array>
          <dict>
            <key>attributeSetting</key>
            <integer>1</integer>
            <key>choiceAttribute</key>
            <string>selected</string>
            <key>choiceIdentifier</key>
            <string>installer_choice_1</string>
          </dict>
          <dict>
            <key>attributeSetting</key>
            <integer>0</integer>
            <key>choiceAttribute</key>
            <string>selected</string>
            <key>choiceIdentifier</key>
            <string>installer_choice_2</string>
          </dict>
        </array>
      </dict>
    </dict>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>%DOWNLOAD_URL%</string>
          <key>filename</key>
          <string>%NAME%.dmg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
        <key>Arguments</key>
        <dict/>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiPkginfoReceiptsEditor</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_ids_set_optional_true</key>
          <array>
            <string>com.google.pkg.Keystone</string>
          </array>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
