<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current version of iTerm2</string>
		<key>Identifier</key>
		<string>com.github.jarias.download.iTerm2</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>iTerm2</string>
			<key>RELEASE</key>
			<string>testing</string>
		</dict>

		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>SparkleUpdateInfoProvider</string>
				<key>Arguments</key>
				<dict>
					<key>appcast_url</key>
					<string>http://www.iterm2.com/appcasts/%RELEASE%.xml</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>purge_destination</key>
					<true/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/iTerm.app</string>
					<key>requirement</key>
					<string>identifier "com.googlecode.iterm2" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = H7V7XYVQ7D</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>