<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the current release version of Maibox and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jarias.munki.Maibox</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Maibox</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/Maibox</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>description</key>
        <string>We redesigned the inbox to make email light, fast, and mobile-friendly. Quickly swipe messages to your archive or trash and scan entire conversations in a chat-like view. It's a whole new inbox.</string>
        <key>display_name</key>
        <string>Maibox</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>category</key>
        <string>Internet</string>
        <key>unattended_install</key>
        <true/>
        <key>unattended_uninstall</key>
        <true/>
      </dict>
    </dict>

    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>SparkleUpdateInfoProvider</string>
        <key>Arguments</key>
        <dict>
          <key>appcast_url</key>
          <string>https://mb-dtop.s3.amazonaws.com/external-beta/external-beta-appcast.xml</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>filename</key>
          <string>%NAME%.zip</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>archive_path</key>
          <string>%pathname%</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%</string>
          <key>purge_destination</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>DmgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>dmg_root</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%</string>
          <key>dmg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%dmg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict>
</plist>
