<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the current release version of Microsoft Remote Desktop Connection and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jarias.munki.rdc</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>RDC</string>
      <key>VERSION</key>
      <string>2.1.1</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/RDC</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>description</key>
        <string></string>
        <key>display_name</key>
        <string>Microsoft Remote Desktop Connection</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
        <key>unattended_uninstall</key>
        <true/>
      </dict>
    </dict>

    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>http://download.microsoft.com/download/C/F/0/CF0AE39A-3307-4D39-9D50-58E699C91B2F/RDC_%VERSION%_ALL.dmg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict>
</plist>
