<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Identifier</key>
		<string>com.github.jarias.munki.bittorrentsync</string>
		<key>Description</key>
		<string>Downloads BitTorrentSync and imports into Munki.</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>BitTorrentSync</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/BitTorrentSync</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>display_name</key>
				<string>%NAME%</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>category</key>
                <string>Internet</string>
                <key>developer</key>
                <string>BitTorrent Inc.</string>
                <key>description</key>
                <string>Fast, private file sharing for teams and individuals.</string>
			</dict>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://download-cdn.getsync.com/stable/osx/BitTorrent-Sync.dmg</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>